# 통계학 1주차 정규과제_Basic

📌통계학 정규과제는 매주 정해진 분량의 『*데이터 분석가가 반드시 알아야 할 모든 것*』 을 읽고 학습하는 것입니다. 이번 주는 아래의 **Statistics_1st_TIL**에 나열된 분량을 읽고 공부하시면 됩니다.

아래의 문제를 풀어보며 학습 내용을 점검하세요. 문제를 해결하는 과정에서 개념을 스스로 정리하고, 필요한 경우 교재를 다시 참고하여 보완하는 것이 좋습니다.

1주차는 데이터 분석을 위한 기초 체력을 다집니다.


## Statistics_1st_TIL

### 01. 통계학 이해하기
1.1. 왜 통계학을 알아야 할까?   
1.2. 머신러닝과 전통적 통계학의 차이   
1.3. 통계학의 정의와 기원   
1.4. 기술 통계와 추론 통계

### 02. 모집단과 표본추출
2.1. 모집단과 표본, 전수조사와 표본조사   
(2.4. 인지적 편향의 종류)   
2.5. 머신러닝 모델 측면의 편향과 분산   

### 03. 변수와 척도
3.1. 변수의 종류   
3.3. 척도의 종류   

### 04. 데이터의 기술 통계적 측정
(4.3. 산포도와 범위, 사분위수, 변동계수)   
4.4. 왜도와 첨도   
4.5. 표준편차의 경험법칙

### 05. 확률과 확률변수
5.3. 분할과 베이지안 이론   
5.5. 심슨의 역설

### 06. 확률분포
6.2. 이산확률분포   
6.3. 연속확률분포   
6.4. 중심극한정리

### 07. 가설검정
7.1. 귀무가설과 대립가설   
7.2. 가설검정의 절차   
7.3. 가설검정의 유의수준과 p값   
7.4. 1종 오류와 2종 오류

## Study Schedule

|주차| 공부 범위     | 완료 여부 |
|---|--------------|----------|
|1주차| 1부 ~p.79    | ✅     |
|2주차| 10~19강      | 🍽️      | 
|3주차| 20~29강      | 🍽️      | 
|4주차| 30~39강      | 🍽️      | 
|5주차| 40~49강      | 🍽️      | 
|6주차| 50~59강      | 🍽️      | 
|7주차| 60~69강      | 🍽️      | 
|8주차| 70~79강      | 🍽️      | 
|9주차| 80~89강      | 🍽️      |

<!-- study schedule은 전체 공부가 끝나면 수정 예정입니다>
<!-- 여기까진 그대로 둬 주세요-->

# 01. 통계학 이해하기

```
✅ 학습 목표 :
* 통계학의 필요성을 안다.
* 기술통계와 추론통계의 특성을 구분하여 이해한다.
```

## 1.1. 왜 통계학을 알아야 할까?

> **🧚 Q. 데이터 분석가는 왜 통계학을 알아야 하나요?**

<!-- 정해진 답은 없습니다. 자유롭게 작성해주세요-->

```
여기에 답을 작성해주세요!
```

> **🧚 일반적인 데이터 과학의 프로세스를 적어주세요.**

```
여기에 답을 작성해주세요!
```


## 1.2. 머신러닝과 전통적 통계학의 차이

> **🧚 빈칸을 채워주세요.**

<!-- 빈칸 안에 공부한 내용을 바탕으로 답을 작성해주세요. 빈칸의 수는 글자 수와 관계 없습니다.-->

> 머신러닝은 ⬜이 주된 목적이다. 따라서 고질적 문제인 ⬜ 해결에 집중한다.   
전통적 통계학은 ⬜이 주된 목적이다. 모집단에서 추출한 샘플에 대한 ⬜을 바탕으로 통계적 모델에 대한 적합성에 집중한다.

```
여기에 답을 작성해주세요!
```


## 1.3. 통계학의 정의와 기원

> **🧚 빈칸을 채워주세요.**

<!-- 빈칸 안에 공부한 내용을 바탕으로 답을 작성해주세요. 빈칸의 수는 글자 수와 관계 없습니다-->

>데이터는 의미 있는 형태인 ⬜로 전환 됐을 때 의사결정에 도움이 될 수 있다.

```
여기에 답을 작성해주세요!
```


## 1.4. 기술 통계와 추론 통계

> **🧚 빈칸을 채워주세요.**

<!-- 빈칸 안에 공부한 내용을 바탕으로 답을 작성해주세요. 빈칸의 수는 글자 수와 관계 없습니다.-->

> 기술통계는 주어진 데이터의 특성을 사실에 근거하여 설명하고 묘사하는 것이다. 데이터를 설명하는 가장 기본적인 방법은 그 데이터의 ⬜을 설명하는 것이다. 이를 설명하기 위해 단순히 수치만 적는 것보다는 ⬜를 사용하는 것이 효과적이다.

```
여기에 답을 작성해주세요!
```


> **🧚 빈칸을 채워주세요.**

<!-- 빈칸 안에 공부한 내용을 바탕으로 답을 작성해주세요. 빈칸의 수는 글자 수와 관계 없습니다.-->

>추론통계는 ⬜으로부터 ⬜의 특성을 추론하는 것이다.

```
여기에 답을 작성해주세요!
```

# 02. 모집단과 표본추출

```
✅ 학습 목표 :
* 모집단과 표본, 모수와 통계량의 정의와 관계를 설명할 수 있다.
(* 분석가가 비논리적인 추론을 내리는 패턴인 인지적 편향의 종류를 이해한다.)
* 편향과 분산의 차이를 이해한다.
```
<!-- 분량 생략 확정 시 학습목표 조정-->

## 2.1. 모집단과 표본, 전수조사와 표본조사

> **🧚 빈칸을 채워주세요.**
<!-- 빈칸 안에 공부한 내용을 바탕으로 답을 작성해주세요. 빈칸의 수는 글자 수와 관계 없습니다.-->

<!-- 1, 2, 3은 각각 동일한 단어입니다.-->

> **통계 분석을 하려면 분석하고자 하는 대상의 데이터가 있어야 한다. 그러나 일반적인 상황에서 모든 데이터를 구하는 것은 현실적으로 어려움이 있다. 따라서 1️⃣의 일부를 추출하여 사용한다. 1️⃣의 일부를 추출한 것을 2️⃣(이)라고 한다. 1️⃣에서 추출한 2️⃣의 통계량을 이용해 3️⃣를 추정한다.**

```
여기에 답을 작성해주세요!
```

(## 2.4. 인지적 편향의 종류)

> **🧚 다음은 인지적 편향의 종류를 빈칸으로 두고 문제를 작성한 것입니다. 각 빈칸에 적합한 편향의 종류를 채워보세요.**

보기
> **확증편향, 기준점편향, 선택지원편향, 분모편향, 생존자편향**

<!-- 2.4.을 제외할지 말지 고민입니다. 만일 포함하게 되면 표 삽입하겠습니다.-->


## 2.5. 머신러닝 모델 측면의 편향과 분산

> **🧚 편향과 분산의 차이에 대해 간단히 적어주세요.**

<!-- 정해진 답은 없습니다. 자유롭게 작성해주세요-->

```
여기에 답을 작성해주세요!
```

# 03. 변수와 척도
```
✅ 학습 목표 :
* 독립변수, 종속변수에 대해 이해한다.
* 척도(변수의 데이터적 속성)의 종류를 알아본다.
* 척도에 따라 어떤 분석방법이 적절한지 판단할 수 있다.
```

## 3.1. 변수의 종류

> **🧚 독립변수와 종속변수에 대해 정리해주세요.**

<!-- 정해진 답은 없습니다. 자유롭게 작성해주세요-->

```
여기에 답을 작성해주세요!
```

## 3.3. 척도의 종류

> **🧚 질적 척도와 양적 척도에 대해 간단하게 정리해주세요.**

<!-- 정해진 답은 없습니다. 자유롭게 작성해주세요-->

```
여기에 답을 작성해주세요!
```

<br>
<br>

> **🧚 어떤 분석 방법이 적절할까요?**
<br>

> 🔍 **Q1. 연속형 변수 간 유사성을 기반으로 그룹을
나누고자 하는 경우**   
Ex1) 고객을 유사한 구매 패턴이나 성향을 가진
그룹으로 나누는 경우   
Ex2) 유사한 주제를 가진 문서들을 같은 그룹으로
분류하는 경우

```
여기에 답을 작성해주세요!
```

<br>

> 🔍 **Q2. 범주형 변수 간 인과관계를 확인하고자 하는 경우**   
Ex1) 광고 유형(A/B 테스트)과 고객 구매 여부 간의
관계를 분석하는 경우     
Ex2) 성별과 특정 질병 유무 간의 연관성을 분석
하는 경우

```
여기에 답을 작성해주세요!
```

<br>

> 🔍 **Q3. 연속형 변수 간 인과관계가 존재하는 경우**   
Ex1) 광고비 지출과 매출 간의 관계를 분석하는 경우     
Ex2) 체중과 혈압 간의 관계를 분석하는 경우

```
여기에 답을 작성해주세요!
```

# 04. 데이터의 기술 통계적 측정

```
✅ 학습 목표 :
* 산포도의 의미와 산포도를 측정하는 방법에 대해 설명할 수 있다.
* 정규분포의 왜도값과 첨도값이 얼마인지 답할 수 있다.
```

(## 4.3. 산포도와 범위, 사분위수, 변동계수)

> **🧚 산포도의 의미와 산포도를 측정하는 방법에 대해 공부한 내용을 정리해주세요.**

<!-- 정해진 답은 없습니다. 자유롭게 작성해주세요-->

```
여기에 답을 작성해주세요!
```

## 4.4. 왜도와 첨도

> **🧚Q. 정규분포의 왜도와 첨도값은 각각 얼마인가요?**

```
여기에 답을 작성해주세요!
```

## 4.5. 표준편차의 경험법칙

> **🧚 표준편차의 경험법칙에 대해 알게 된 내용을 간단히 정리해주세요.**

```
여기에 답을 작성해주세요!
```

# 05. 확률과 확률변수

```
✅ 학습 목표 :
* 베이즈 정리의 개념을 이해하고 이를 실생활 예제에 적용할 수 있다.
* 심슨의 역설을 경계하여 데이터를 분석할 때 세부 그룹별 패턴을 고려해 잘못된 결론을 방지할 수 있다.
```

## 5.3. 분할과 베이지안 이론

<!-- 분할과 베이지안 이론에 대해 학습하고 이해한 내용을 정리해주세요.-->

> **🧚Q. (주)다트비의 조일 과장은 이커머스 플랫폼의 마케팅 업무를 담당하고 있다. 최근 회사에서는 배너 광고의 클릭률(CTR)이 기대보다 낮아 최적의 광고 타겟층을 선정하는 프로젝트를 진행 중이다. 조 과장은 광고 효과를 높이기 위해 고민하던 중, 사이트 방문자의 70%가 모바일 유저, 30%가 PC 유저라는 정보를 알아냈다. 그래서 모바일 유저를 타깃으로 배너 광고를 올리면 되겠다 생각했는데 알고 보니 PC 유저의 광고 클릭률(CTR)이 5%로, 모바일 유저의 광고 클릭률(CTR)보다 4%p 높았다. 이런 경우, 모바일과 PC 중 어느 유저층에 집중하여 배너 광고를 올리는 것이 더 효과적일까? (소수점 둘째자리까지 반올림하여 답해주세요.)**

> 💝 **Hint**   
-P(클릭)을 구한다.  
-P(모바일 유저|클릭)과 P(PC 유저|클릭)을 구하고 값을 비교한다.

<!-- 베이즈 정리를 이해하였는지 확인하기 위한 문제입니다. 문제의 답과 풀이를 작성해주세요. 힌트를 참고하셔도 좋습니다.-->

```
여기에 답을 작성해주세요!
```

## 5.5. 심슨의 역설

<!-- 데이터의 세부 그룹별로 일정한 추세나 경향성이 나타나지만, 전체적으로 보면 그 추세가 사라지거나 반대 방향의 경향성을 나타내기도 합니다. 때문에 데이터 분석가는 데이터를 어떻게 나누고 결합하고 가공하는가에 따라 결과가 정반대로 바뀔 수 있음을 항상 경계해야 합니다.-->

> **🧚Q. 한 대형 병원이 두 명의 외과 의사(A와 B)의 수술 성공률을 비교하려고 한다. 과거 1년간의 데이터를 보면, A 의사의 전체 수술 성공률은 80%, B 의사의 전체 수술 성공률은 90%였다. 이 데이터를 본 병원 경영진은 A 의사의 실력이 B 의사보다 별로라고 판단하여 A 의사의 수술 기회를 줄이는 방향으로 정책을 조정하려 한다.
그러나 일부 의료진은 이 결론에 의문을 제기했다.
그들은 "단순한 전체 성공률이 아니라 더 세부적인 데이터를 분석해야 한다"고 주장했다.    
-A 의사의 실력이 실제로 B 의사보다 별로라고 결론짓는 것이 타당한가?   
-그렇지 않다면, 추가로 확인해야 할 정보는 무엇인가?**

<!-- 심슨의 역설을 이해하였는지 확인하기 위한 문제입니다-->

<!-- 정해진 답은 없습니다. 자유롭게 작성해주세요-->

```
여기에 답을 작성해주세요!
```

# 06. 확률분포

```
✅ 학습 목표 :
* 이산확률분포의 종류에 대해 알고, 각각의 특징과 활용 사례를 설명할 수 있다.
* 연속확률분포의 종류와 특징을 설명할 수 있다. 
* 중심극한정리(CLT)의 개념을 이해하고 설명 할 수 있다.
```

[이산확률분포와 연속확률분포 추가자료](https://velog.io/@tngus0325/%EC%9D%B4%EC%82%B0%ED%99%95%EB%A5%A0-%EB%B6%84%ED%8F%AC%EC%99%80-%EC%97%B0%EC%86%8D%ED%99%95%EB%A5%A0-%EB%B6%84%ED%8F%AC-%EC%A0%95%EB%A6%AC)

## 6.2. 이산확률분포

> **🧚 이산확률분포에 대해 학습한 내용을 정리해주세요.**

<!--수식과 공식을 암기하기보다는 분포의 개념과 특성을 위주로 공부해주세요. 분석 대상의 데이터가 어떠한 확률분포의 특성을 가지고 있는지를 아는 것이 더 중요합니다.-->

<!-- 정해진 답은 없습니다. 자유롭게 작성해주세요-->

```
여기에 답을 작성해주세요!
```

## 6.3. 연속확률분포

> **🧚 연속확률분포에 대해 학습한 내용을 정리해주세요.**

<!--수식과 공식을 암기하기보다는 분포의 개념과 특성을 위주로 공부해주세요. 분석 대상의 데이터가 어떠한 확률분포의 특성을 가지고 있는지를 아는 것이 더 중요합니다.-->

<!-- 정해진 답은 없습니다. 자유롭게 작성해주세요-->

```
여기에 답을 작성해주세요!
```

[중심극한정리 시뮬레이션](https://www.youtube.com/watch?v=aIPvgiXyBMI)

## 6.4. 중심극한정리

> **🧚 중심극한정리에 대해 학습한 내용을 정리해주세요.**

<!-- 정해진 답은 없습니다. 자유롭게 작성해주세요-->

```
여기에 답을 작성해주세요!
```

# 07. 가설검정

```
✅ 학습 목표 :
* 귀무가설과 대립가설의 개념을 이해하고, 가설을 설정하는 원리를 설명할 수 있다.
* 가설검정의 유의수준과 p값의 의미를 이해하고, p값을 해석하여 귀무가설을 기각할지 여부를 판단할 수 있다.
* 1종 오류와 2종 오류의 차이를 설명하고, 실제 사례에서 어떤 오류를 더 중요하게 고려해야 하는지 분석할 수 있다.
```

## 7.1. 귀무가설과 대립가설

> **🧚 귀무가설과 대립가설에 대해 학습한 내용을 정리해주세요.**

<!-- 정해진 답은 없습니다. 자유롭게 작성해주세요-->

```
여기에 답을 작성해주세요!
```

## 7.2. 가설검정의 절차

<!-- 공부한 내용을 자유롭게 기술해주세요.-->

> **🧚 OX 문제입니다.**

> **다음 명제가 유의수준 5%를 설정한 것과 동일한 의미인지 판단하세요.   
1️⃣ 표본이 귀무가설과 같을 확률이 5% 미만이다.   
2️⃣ 귀무가설이 참일 확률이 5%이다.   
3️⃣ 귀무가설이 참일 때, 극단적인 표본이 나올 확률을 5%로 설정한 것이다.**

<!-- 동일하면 O, 동일하지 않으면 X.-->

```
여기에 답을 작성해주세요!
```

## 7.3. 가설검정의 유의수준과 p값

> **🧚Q. 다음 중 귀무가설(H₀)을 기각해야 하는 경우는 언제인가요? 정답을 고르고, 그 이유를 간단히 설명해주세요.**

> **1️⃣ 유의수준(α)이 0.05이고, p값이 0.03일 때   
2️⃣ 유의수준(α)이 0.01이고, p값이 0.02일 때**

```
여기에 답을 작성해주세요!
```

## 7.4. 1종 오류와 2종 오류

> **🧚 1종 오류와 2종 오류에 대해 학습한 내용을 정리해주세요.**

<!-- 정해진 답은 없습니다. 자유롭게 작성해주세요-->

```
여기에 답을 작성해주세요!
```

### 🎉 수고하셨습니다.
